{
  "my-insights": {
    "title": "My INsights",
    "subtitle": "Operational management platform",
    "description": "The MyINsights Platform, also known as MyIN, aims to generate insights for the operational management of teams in the field, consolidating business data, device management, tickets and contracts in a single location, thus simplifying daily activities and increasing efficiency throughout the process.",
    "role": "Architecture and Development",
    "timeline": "2022-now",
    "features": [
      {
        "title": "Secure Authentication",
        "description": "Login page using next-auth for secure user authentication."
      },
      {
        "title": "Intuitive Homepage",
        "description": "The homepage where all dashboards are shown for quick access."
      },
      {
        "title": "Interactive Dashboards",
        "description": "Working integration with Power BI embedded reports for data visualization."
      }
    ]
  },
  "integratis-api": {
    "title": "Integratis API",
    "subtitle": "Backend API for system integration and ETL automations",
    "description": "Integratis API is a RESTful API developed to integrate different systems and databases into a unified interface and to manage and execute ETL automations developed by the team. It is currently on its second version, with a more robust architecture and improved performance. Due to budget limitations, I've also developed a custom Storage Service to handle file uploads and downloads, which is used by other services in the company.",
    "role": "Architecture and Development",
    "timeline": "2022-now",
    "features": [
      {
        "title": "Swagger Documentation",
        "description": "Documentation auto generated using DTO classes and decorators."
      },
      {
        "title": "Integrations and ETL Automations",
        "description": "Management of cron jobs to integrate and automate ETL python scripts."
      },
      {
        "title": "Secure Authentication",
        "description": "Secured with NestJS AuthGuard and Public decorators."
      }
    ]
  },
  "vaske-admin": {
    "title": "Vaske Admin",
    "subtitle": "Administrative dashboard template",
    "description": "Vaske Admin is a versatile admin dashboard template built with modern web technologies, designed to be easily customizable and feature-rich for various administrative needs. Its a project that I used mainly to learn and pratice React. It served as the basis for the development of MyINsights later.",
    "role": "Full Stack Developer",
    "timeline": "2021-2022",
    "features": [
      {
        "title": "Interactive Analytics",
        "description": "Real-time analytics with interactive charts and graphs."
      },
      {
        "title": "Power BI Integration",
        "description": "Power BI integration with RLS support."
      },
      {
        "title": "Google OAuth",
        "description": "Integration with google OAuth for a fast register/login service."
      },
      {
        "title": "Theme Customization",
        "description": "Custom theme for the users preference."
      }
    ]
  }
}